Repository: Sayarhtoo1/edu_sync
Catalog: lib/l10n/app_*.arb
Languages: my

# categoryValidator
source: Please enter a category.
my: ကျေးဇူးပြု၍ အမျိုးအစား ရွေးပါ

# saveButton
source: Save
my: သိမ်းမည်

# phoneNumberLabel
source: Phone Number
my: ဖုန်းနံပါတ်

# addressLabel
source: Address
my: လိပ်စာ

# profilePhotoLabel
source: Profile Photo
my: ပရိုဖိုင်ဓာတ်ပုံ

# selectImageButton
source: Select Image
my: ပုံ ရွေးပါ

# imageSelectedText
source: Image Selected
my: ပုံ ရွေးပြီး

# noImageSelectedText
source: No Image Selected
my: ပုံ မရွေးရသေး

# linkedStudentsLabel
source: Linked Students
my: ချိတ်ဆက်ထားသော ကျောင်းသားများ

# linkStudentButton
source: Link Student
my: ကျောင်းသား ချိတ်ဆက်ရန်

# searchStudentHint
source: Search student by name or ID
my: ကျောင်းသားအမည် (သို့) ID ဖြင့် ရှာပါ

source: No students found to link
my: ချိတ်ဆက်ရန် ကျောင်းသား မတွေ့ပါ

# saveParentButton
source: Save Parent
my: မိဘ သိမ်းဆည်းရန်

# noClassesAvailableHint
source: No classes available
my: ရွေးချယ်ရန် အတန်းများ မရှိပါ

# rollNumberLabel
source: Roll Number
my: ခုံနံပါတ်

# parentEmailOptionalLabel
source: Parent Email (Optional)
my: မိဘ အီးမေးလ် (ရွေးချယ်နိုင်)

# classValidator
source: Please select a class
my: ကျေးဇူးပြု၍ အတန်း ရွေးပါ

# dateOfBirthValidator
source: Please enter date of birth
my: ကျေးဇူးပြု၍ မွေးသက္ကရာဇ် ထည့်ပါ

# subjectSpecializationLabel
source: Subject Specialization
my: အထူးပြု ဘာသာရပ်

# qualificationsLabel
source: Qualifications
my: အရည်အချင်းများ

# dateJoinedLabel
source: Date Joined
my: ဝင်ရောက်သည့်ရက်

# dayOfWeekLabel
source: Day of Week
my: နေ့

# selectDayHint
source: Select Day
my: နေ့ ရွေးပါ

# startTimeValidator
source: Please select start time
my: ကျေးဇူးပြု၍ စတင်ချိန် ရွေးပါ

# endTimeValidator
source: Please select end time
my: ကျေးဇူးပြု၍ ပြီးဆုံးချိန် ရွေးပါ

# manageClassesTitle
source: Manage Classes
my: အတန်းများ စီမံရန်

# noClassesFound
source: No classes found. Add one!
my: အတန်းများ မတွေ့ပါ။ တစ်ခုထည့်ရန်!

# confirmDeleteClassText
source: Are you sure you want to delete this class?
my: ဤအတန်းကို ဖျက်ရန် သေချာပါသလား။

# editSchoolProfileTitle
source: Edit School Profile
my: ကျောင်း ပရိုဖိုင် ပြင်ရန်

# schoolLogoLabel
source: School Logo
my: ကျောင်း လိုဂို

# changeLogoButton
source: Change Logo
my: လိုဂို ပြောင်းရန်

# saveChangesButton
source: Save Changes
my: အပြောင်းအလဲများ သိမ်းဆည်းရန်

source: Total Income
my: စုစုပေါင်း ဝင်ငွေ

source: Total Expenses
my: စုစုပေါင်း အသုံးစရိတ်

source: Net Balance
my: လက်ကျန်ငွေ

source: No transactions found.
my: ငွေလွှဲပြောင်းမှု မှတ်တမ်းများ မတွေ့ပါ။

# addTransactionButton
source: Add Transaction
my: ငွေလွှဲပြောင်းမှု ထည့်ရန်

# confirmDeleteTransactionText
source: Are you sure you want to delete this transaction?
my: ဤငွေလွှဲပြောင်းမှုကို ဖျက်ရန် သေချာပါသလား။

# manageCustomFormsTitle
source: Manage Custom Forms
my: စိတ်ကြိုက်ပုံစံများ စီမံရန်

# addCustomFormButton
source: Add Custom Form
my: စိတ်ကြိုက်ပုံစံ ထည့်ရန်

# viewResponsesButton
source: View Responses
my: တုံ့ပြန်မှုများ ကြည့်ရန်

# confirmDeleteFormText
source: Are you sure you want to delete this form?
my: ဤပုံစံကို ဖျက်ရန် သေချာပါသလား။

# schoolRegistrationTitle
source: School Registration
my: ကျောင်း မှတ်ပုံတင်ရန်

# schoolDetailsStep
source: School Details
my: ကျောင်း အချက်အလက်

# adminAccountStep
source: Admin Account
my: အက်မင် အကောင့်

# nextButton
source: Next
my: ရှေ့ဆက်ရန်

# previousButton
source: Previous
my: နောက်သို့

# manageStudentsTitle
source: Manage Students
my: ကျောင်းသားများ စီမံရန်

# confirmDeleteStudentText
source: Are you sure you want to delete this student? This action cannot be undone.
my: ဤကျောင်းသားကို ဖျက်ရန် သေချာပါသလား။ ဤလုပ်ဆောင်ချက်ကို နောက်ပြန်လှည့်၍မရပါ။

# manageTimetablesTitle
source: Manage Timetables
my: အချိန်ဇယားများ စီမံရန်

# selectClassToViewTimetableHint
source: Select Class to View Timetable
my: အချိန်ဇယား ကြည့်ရန် အတန်း ရွေးပါ

# pleaseSelectClassToViewTimetableText
source: Please select a class to view its timetable.
my: အချိန်ဇယား ကြည့်ရန် ကျေးဇူးပြု၍ အတန်းတစ်ခု ရွေးပါ။

# noTimetableEntriesForText
source: No timetable entries for
my: အတွက် အချိန်ဇယား ထည့်သွင်းမှုများ မရှိပါ

# addOneText
source: Add one!
my: တစ်ခုထည့်ရန်!

# confirmDeleteTimetableEntryText
source: Are you sure you want to delete this timetable entry?
my: ဤအချိန်ဇယား ထည့်သွင်းမှုကို ဖျက်ရန် သေချာပါသလား။

# manageUsersTitle
source: Manage Users
my: အသုံးပြုသူများ စီမံရန်

# noUsersFoundTextPart1
source: No
my: မရှိပါ

# noUsersFoundTextPart2
source: found. Add one!
my: မတွေ့ပါ။ တစ်ခုထည့်ရန်!

# confirmDeleteUserTextPart1
source: Are you sure you want to delete this
my: ဤ

# forgotPasswordButtonLabel
source: Forgot Password?
my: စကားဝှက် မေ့နေပါသလား။

# registerNewSchoolButtonLabel
source: Register New School (Admin)
my: ကျောင်းအသစ် မှတ်ပုံတင်ရန် (အက်မင်)

# adminFullNameLabel
source: Admin's Full Name
my: အက်မင် အမည်အပြည့်အစုံ

# adminFullNameValidator
source: Please enter admin's full name
my: ကျေးဇူးပြု၍ အက်မင် အမည်အပြည့်အစုံ ထည့်ပါ။

# adminEmailLabel
source: Admin Email
my: အက်မင် အီးမေးလ်

# adminEmailValidator
source: Please enter admin email
my: ကျေးဇူးပြု၍ အက်မင် အီးမေးလ် ထည့်ပါ။

# adminPasswordLabel
source: Admin Password
my: အက်မင် စကားဝှက်

# confirmAdminPasswordLabel
source: Confirm Admin Password
my: အက်မင် စကားဝှက် အတည်ပြုပါ

# academicYearHint
source: e.g., 2024-2025
my: ဥပမာ၊ ၂၀၂၄-၂၀၂၅

source: No logo selected
my: လိုဂို မရွေးရသေးပါ

# logoSelectedLabel
source: Logo selected
my: လိုဂို ရွေးပြီး

# selectLogoButton
source: Select Logo
my: လိုဂို ရွေးပါ

source: Enable Notifications
my: အသိပေးချက်များ ဖွင့်ရန်

# aboutAppTitle
source: About EduSync Myanmar
my: EduSync Myanmar အကြောင်း

# versionLabel
source: Version
my: ဗားရှင်း

# appTagline
source: School Management, Simplified.
my: ကျောင်းစီမံခန့်ခွဲမှုကို ရိုးရှင်းလွယ်ကူစေသည်။

# editButton
source: Edit
my: ပြင်ရန်

# deleteButton
source: Delete
my: ဖျက်မည်

# confirmDeleteMessage
source: Are you sure you want to delete this item?
my: ဤအရာကို ဖျက်ရန် သေချာပါသလား။

source: No teacher assigned
my: ဆရာ/မ သတ်မှတ်မထားပါ

# cannotDeleteMissingIdError
source: Cannot delete: Item ID is missing.
my: ဖျက်၍မရပါ - အရာဝတ္ထု ID မရှိပါ။

# logoUrlLabel
source: Logo URL (Optional)
my: လိုဂို URL (ရွေးချယ်နိုင်)

# themeLabel
source: App Theme
my: အက်ပ် အပြင်အဆင်

# themeHint
source: Select a theme
my: အပြင်အဆင် ရွေးပါ

# updateProfileButton
source: Update Profile
my: ပရိုဖိုင် ပြင်ဆင်ရန်

# registerSchoolButton
source: Register School
my: ကျောင်း မှတ်ပုံတင်ရန်

# confirmDeleteTeacherText
source: Are you sure you want to delete this teacher?
my: ဤဆရာ/မကို ဖျက်ရန် သေချာပါသလား။

# manageTeachersTitle
source: Manage Teachers
my: ဆရာများ စီမံရန်

# noTeachersFound
source: No teachers found. Add one!
my: ဆရာ/မများ မတွေ့ပါ။ တစ်ခုထည့်ရန်!

# parentDashboardTitle
source: Parent Dashboard
my: မိဘ ဒက်ရှ်ဘုတ်

# parentDashboardWelcomeMessage
source: Welcome, Parent! Use the drawer to view your child's information and announcements.
my: မိဘ၊ ကြိုဆိုပါတယ်။ သင်၏ကလေး အချက်အလက်များနှင့် ကြေညာချက်များ ကြည့်ရန် အံဆွဲကို အသုံးပြုပါ။

# teacherDashboardTitle
source: Teacher Dashboard
my: ဆရာ ဒက်ရှ်ဘုတ်

# teacherDashboardWelcomeMessage
source: Welcome, Teacher! Use the drawer to access your tools.
my: ဆရာ/မ၊ ကြိုဆိုပါတယ်။ သင်၏ကိရိယာများ အသုံးပြုရန် အံဆွဲကို အသုံးပြုပါ။

# unknownUserRoleError
source: Unknown user role. Please contact support.
my: အသုံးပြုသူအခန်းကဏ္ဍကို မသိပါ။ ကျေးဇူးပြု၍ အကူအညီတောင်းပါ။

# loginFailedError
source: Login failed. Please check your email and password.
my: ဝင်ရောက်ခြင်း မအောင်မြင်ပါ။ သင်၏အီးမေးလ်နှင့် စကားဝှက်ကို စစ်ဆေးပါ။

# registrationSuccessMessage
source: School and Admin registered successfully! Please log in.
my: ကျောင်းနှင့် အက်မင် အောင်မြင်စွာ မှတ်ပုံတင်ပြီးပါပြီ။ ကျေးဇူးပြု၍ ဝင်ရောက်ပါ။

# failedToLinkAdminError
source: Critical: Failed to link admin to the new school. Please contact support.
my: အရေးကြီး: အက်မင်ကို ကျောင်းအသစ်နှင့် ချိတ်ဆက်ရာတွင် မအောင်မြင်ပါ။ ကျေးဇူးပြု၍ အကူအညီတောင်းပါ။

# teacherLabel
source: Teacher
my: ဆရာ/မ

# schoolNameLabel
source: School Name
my: ကျောင်းအမည်

# schoolNameValidator
source: Please enter school name
my: ကျေးဇူးပြု၍ ကျောင်းအမည် ထည့်ပါ။

# academicYearLabel
source: Academic Year
my: ပညာသင်နှစ်

# contactInfoLabel
source: Contact Info
my: ဆက်သွယ်ရန် အချက်အလက်

# noStudentsFound
source: No students found. Add one!
my: ကျောင်းသားများ မတွေ့ပါ။ တစ်ခုထည့်ရန်!

# registerSchoolAdminTitle
source: Register School & Admin
my: ကျောင်းနှင့် အက်မင် မှတ်ပုံတင်ရန်

# confirmPasswordValidator
source: Please confirm password
my: ကျေးဇူးပြု၍ စကားဝှက် အတည်ပြုပါ။

# passwordsDoNotMatchValidator
source: Passwords do not match
my: စကားဝှက်များ မတူညီပါ။

# registerButton
source: Register
my: မှတ်ပုံတင်မည်
