Repository: Sayarhtoo1/edu_sync
Catalog: lib/l10n/app_*.arb
Languages: my

# appTitle
source: EduSync Myanmar
my: EduSync မြန်မာ

source: Login
my: ဝင်မည်

source: Email
my: အီးမေးလ်

source: Password
my: စကားဝှက်

source: Admin Panel
my: အက်မင် ပאנل

source: Teacher Dashboard
my: ဆရာ ဒက်ရှ်ဘုတ်

source: Parent Dashboard
my: မိဘ ဒက်ရှ်ဘုတ်

source: Welcome, Admin!
my: အက်မင်၊ ကြိုဆိုပါတယ်။

source: Welcome, Teacher!
my: ဆရာ/မ၊ ကြိုဆိုပါတယ်။

source: Welcome, Parent!
my: မိဘ၊ ကြိုဆိုပါတယ်။

# useDrawerToNavigate
source: Use the drawer to navigate.
my: သွားလာရန် အံဆွဲကို အသုံးပြုပါ။

source: Settings
my: ဆက်တင်များ

source: Language
my: ဘာသာစကား

source: Logout
my: ထွက်မည်

source: Teachers
my: ဆရာများ

source: Parents
my: မိဘများ

source: Students
my: ကျောင်းသားများ

source: Classes
my: အတန်းများ

# error_user_not_found
source: Error: User not found. Please log in again.
my: အမှားအယွင်း - အသုံးပြုသူကို ရှာမတွေ့ပါ။ ကျေးဇူးပြု၍ ပြန်လည်ဝင်ရောက်ပါ။

# error_school_not_selected_or_found
source: Error: School not selected or found. Please ensure a school is associated with your account.
my: အမှားအယွင်း - ကျောင်းကို ရွေးချယ်ထားခြင်း သို့မဟုတ် ရှာမတွေ့ပါ။ သင်၏အကောင့်နှင့် ကျောင်းတစ်ခု ချိတ်ဆက်ထားကြောင်း သေချာပါစေ။

source: Error fetching timetable
my: အချိန်ဇယား ရယူရာတွင် အမှားအယွင်းဖြစ်ပွားခဲ့သည်။

# my_timetable_title
source: My Timetable
my: ကျွန်ုပ်၏ အချိန်ဇယား

source: No timetable entries found.
my: အချိန်ဇယား ထည့်သွင်းမှုများ မတွေ့ပါ။

source: Monday
my: တနင်္လာ

source: Tuesday
my: အင်္ဂါ

source: Wednesday
my: ဗုဒ္ဓဟူး

source: Thursday
my: ကြာသပတေး

source: Friday
my: သောကြာ

source: Saturday
my: စနေ

source: Sunday
my: တနင်္ဂနွေ

source: Unknown Subject
my: အမည်မသိ ဘာသာရပ်

# classLabel
source: Class
my: အတန်း

source: Unknown Class
my: အမည်မသိ အတန်း

source: Time
my: အချိန်

source: Room
my: အခန်း

source: Not Specified
my: သတ်မှတ်မထားပါ

# markAttendanceTitle
source: Mark Attendance
my: တက်ရောက်မှု မှတ်သားရန်

# selectClassHint
source: Select Class
my: အတန်း ရွေးပါ

# pleaseSelectClass
source: Please select a class.
my: ကျေးဇူးပြု၍ အတန်းတစ်ခု ရွေးပါ။

# noStudentsInClass
source: No students in this class.
my: ဤအတန်းတွင် ကျောင်းသားမရှိပါ။

# saveAttendanceButton
source: Save Attendance
my: တက်ရောက်မှု သိမ်းဆည်းရန်

# classTeacherInfoMissing
source: Class or teacher information missing.
my: အတန်း သို့မဟုတ် ဆရာ/မ အချက်အလက် မပြည့်စုံပါ။

# attendanceSavedSuccess
source: Attendance saved successfully!
my: တက်ရောက်မှုကို အောင်မြင်စွာ သိမ်းဆည်းပြီးပါပြီ။

# attendanceSaveFailed
source: Failed to save attendance.
my: တက်ရောက်မှု သိမ်းဆည်းခြင်း မအောင်မြင်ပါ။

# attendanceStatusPresent
source: Present
my: ရောက်ရှိ

# attendanceStatusAbsent
source: Absent
my: ပျက်ကွက်

# attendanceStatusLate
source: Late
my: နောက်ကျ

# manageLessonPlansTitle
source: Manage Lesson Plans
my: သင်ခန်းစာ အစီအစဉ်များ စီမံရန်

# pleaseSelectClassToViewLessonPlans
source: Please select a class to view lesson plans.
my: သင်ခန်းစာ အစီအစဉ်များ ကြည့်ရန် အတန်းတစ်ခု ရွေးပါ။

# noLessonPlansFound
source: No lesson plans found for this class.
my: ဤအတန်းအတွက် သင်ခန်းစာ အစီအစဉ်များ မတွေ့ပါ။

# addLessonPlanTooltip
source: Add New Lesson Plan
my: သင်ခန်းစာ အစီအစဉ်သစ် ထည့်ရန်

# confirmDeleteTitle
source: Confirm Delete
my: ဖျက်ရန် အတည်ပြုပါ

# confirmDeleteLessonPlanText
source: Are you sure you want to delete this lesson plan?
my: ဤသင်ခန်းစာ အစီအစဉ်ကို ဖျက်ရန် သေချာပါသလား။

source: Cancel
my: မလုပ်တော့ပါ

source: Delete
my: ဖျက်မည်

source: Error deleting lesson plan.
my: သင်ခန်းစာ အစီအစဉ် ဖျက်ရာတွင် အမှားအယွင်းဖြစ်ပွားခဲ့သည်။

source: Date
my: ရက်စွဲ

# addEditLessonPlanNotImplemented
source: Add/Edit Lesson Plan screen not yet implemented.
my: သင်ခန်းစာ အစီအစဉ် ထည့်/ပြင်ရန် မျက်နှာပြင်ကို မပြုလုပ်ရသေးပါ။

# editClassTitle
source: Edit Class
my: အတန်း ပြင်ရန်

# addClassTitle
source: Add Class
my: အတန်းသစ် ထည့်ရန်

# classNameLabel
source: Class Name
my: အတန်းအမည်

# classNameValidator
source: Please enter class name
my: ကျေးဇူးပြု၍ အတန်းအမည် ထည့်ပါ။

# selectClassTeacherHint
source: Select Class Teacher
my: အတန်းပိုင် ဆရာ/မ ရွေးပါ

# classTeacherLabel
source: Class Teacher
my: အတန်းပိုင် ဆရာ/မ

# classTeacherValidator
source: Please select a teacher
my: ကျေးဇူးပြု၍ ဆရာ/မ တစ်ဦး ရွေးပါ။

# updateClassButton
source: Update Class
my: အတန်း အချက်အလက် ပြင်ရန်

# addClassButton
source: Add Class
my: အတန်းသစ် ထည့်ရန်

# failedToLoadTeachersError
source: Failed to load teachers.
my: ဆရာ/မများ စာရင်း ရယူခြင်း မအောင်မြင်ပါ။

# errorOccurredPrefix
source: An error occurred
my: အမှားအယွင်း ဖြစ်ပွားခဲ့သည်

# failedToSaveClassError
source: Failed to save class.
my: အတန်း သိမ်းဆည်းခြင်း မအောင်မြင်ပါ။

source: Unnamed Teacher
my: အမည်မဖော်ပြထားသော ဆရာ/မ

# editTeacherTitle
source: Edit Teacher
my: ဆရာ/မ အချက်အလက် ပြင်ရန်

# addTeacherTitle
source: Add Teacher
my: ဆရာ/မ အသစ်ထည့်ရန်

# fullNameLabel
source: Full Name
my: အမည်အပြည့်အစုံ

# fullNameValidator
source: Please enter full name
my: ကျေးဇူးပြု၍ အမည်အပြည့်အစုံ ထည့်ပါ။

# emailLabel
source: Email
my: အီးမေးလ်

# emailValidator
source: Please enter email
my: ကျေးဇူးပြု၍ အီးမေးလ် ထည့်ပါ။

# passwordLabel
source: Password (min. 6 characters)
my: စကားဝှက် (အနည်းဆုံး စာလုံး ၆ လုံး)

# passwordRequiredValidator
source: Password is required
my: စကားဝှက် လိုအပ်သည်

# passwordTooShortValidator
source: Password too short
my: စကားဝှက် တိုလွန်းသည်

source: No profile photo
my: ပရိုဖိုင်ဓာတ်ပုံ မရှိပါ

source: Could not load image
my: ပုံကို တင်၍မရပါ

# selectPhotoButton
source: Select Photo
my: ဓာတ်ပုံ ရွေးပါ

# updateTeacherButton
source: Update Teacher
my: ဆရာ/မ အချက်အလက် ပြင်ရန်

# addTeacherButton
source: Add Teacher
my: ဆရာ/မ အသစ်ထည့်ရန်

# passwordRequiredForNewTeacherError
source: Password is required for new teacher.
my: ဆရာ/မ အသစ်အတွက် စကားဝှက် လိုအပ်ပါသည်။

# newTeacherCreationDisabledError
source: New teacher creation is temporarily disabled. Please use Supabase dashboard or an Edge Function.
my: ဆရာ/မ အသစ်ပြုလုပ်ခြင်းကို ခေတ္တပိတ်ထားသည်။ Supabase dashboard (သို့) Edge Function ကို အသုံးပြုပါ။

# profilePhotoUploadFailedError
source: Profile photo upload failed.
my: ပရိုဖိုင်ဓာတ်ပုံ တင်ခြင်း မအောင်မြင်ပါ။

# failedToUpdateTeacherError
source: Failed to update teacher.
my: ဆရာ/မ အချက်အလက် ပြင်ဆင်ခြင်း မအောင်မြင်ပါ။

# failedToCreateTeacherError
source: Failed to create teacher.
my: ဆရာ/မ အသစ်ပြုလုပ်ခြင်း မအောင်မြင်ပါ။

# editParentTitle
source: Edit Parent
my: မိဘ အချက်အလက် ပြင်ရန်

# addParentTitle
source: Add Parent
my: မိဘ အသစ်ထည့်ရန်

# updateParentButton
source: Update Parent
my: မိဘ အချက်အလက် ပြင်ရန်

# addParentButton
source: Add Parent
my: မိဘ အသစ်ထည့်ရန်

# passwordRequiredForNewParentError
source: Password is required for new parent.
my: မိဘ အသစ်အတွက် စကားဝှက် လိုအပ်ပါသည်။

# newParentCreationDisabledError
source: New parent creation is temporarily disabled. Please use Supabase dashboard or an Edge Function.
my: မိဘ အသစ်ပြုလုပ်ခြင်းကို ခေတ္တပိတ်ထားသည်။ Supabase dashboard (သို့) Edge Function ကို အသုံးပြုပါ။

# failedToUpdateParentError
source: Failed to update parent.
my: မိဘ အချက်အလက် ပြင်ဆင်ခြင်း မအောင်မြင်ပါ။

# failedToCreateParentError
source: Failed to create parent.
my: မိဘ အသစ်ပြုလုပ်ခြင်း မအောင်မြင်ပါ။

# editStudentTitle
source: Edit Student
my: ကျောင်းသား ပြင်ရန်

# addStudentTitle
source: Add Student
my: ကျောင်းသားသစ် ထည့်ရန်

# dateOfBirthLabel
source: Date of Birth
my: မွေးသက္ကရာဇ်

# selectClassOptionalHint
source: Select Class (Optional)
my: အတန်း ရွေးပါ (ရွေးချယ်နိုင်)

# classOptionalLabel
source: Class (Optional)
my: အတန်း (ရွေးချယ်နိုင်)

# updateStudentButton
source: Update Student
my: ကျောင်းသား အချက်အလက် ပြင်ရန်

# addStudentButton
source: Add Student
my: ကျောင်းသားသစ် ထည့်ရန်

# failedToLoadClassesError
source: Failed to load classes.
my: အတန်းများ စာရင်း ရယူခြင်း မအောင်မြင်ပါ။

# failedToUpdateStudentError
source: Failed to update student.
my: ကျောင်းသား အချက်အလက် ပြင်ဆင်ခြင်း မအောင်မြင်ပါ။

# failedToCreateStudentError
source: Failed to create student.
my: ကျောင်းသားသစ် ပြုလုပ်ခြင်း မအောင်မြင်ပါ။

# editTimetableEntryTitle
source: Edit Timetable Entry
my: အချိန်ဇယား ပြင်ရန်

# addTimetableEntryTitle
source: Add Timetable Entry
my: အချိန်ဇယား ထည့်ရန်

# subjectNameLabel
source: Subject Name
my: ဘာသာရပ်အမည်

# subjectNameValidator
source: Please enter subject name
my: ကျေးဇူးပြု၍ ဘာသာရပ်အမည် ထည့်ပါ။

# selectDayOfWeekHint
source: Select Day of Week
my: နေ့ ရွေးပါ

# dayValidator
source: Please select a day
my: ကျေးဇူးပြု၍ နေ့တစ်ခု ရွေးပါ။

# startTimeLabelPrefix
source: Start Time:
my: စတင်ချိန်:

# endTimeLabelPrefix
source: End Time:
my: ပြီးဆုံးချိန်:

# timeNotSet
source: Not set
my: မသတ်မှတ်ရသေး

# updateEntryButton
source: Update Entry
my: ပြင်ဆင်ရန်

# addEntryButton
source: Add Entry
my: ထည့်ရန်

# fillAllFieldsError
source: Please fill all fields, including time, day, class, and teacher.
my: ကျေးဇူးပြု၍ အချိန်၊ နေ့၊ အတန်း၊ နှင့် ဆရာ/မ အပါအဝင် အကွက်အားလုံးကို ဖြည့်ပါ။

# endTimeAfterStartTimeError
source: End time must be after start time.
my: ပြီးဆုံးချိန်သည် စတင်ချိန်ထက် နောက်ကျရပါမည်။

# failedToSaveTimetableEntryError
source: Failed to save timetable entry.
my: အချိန်ဇယား သိမ်းဆည်းခြင်း မအောင်မြင်ပါ။

# failedToLoadTimetableDataError
source: Failed to load necessary data for timetable entry.
my: အချိန်ဇယားအတွက် လိုအပ်သော အချက်အလက်များ ရယူခြင်း မအောင်မြင်ပါ။

# financeManagementTitle
source: Finance Management
my: ဘဏ္ဍာရေး စီမံခန့်ခွဲမှု

# incomeTabLabel
source: Income
my: ဝင်ငွေ

# expensesTabLabel
source: Expenses
my: အသုံးစရိတ်

# addIncomeTooltip
source: Add Income Record
my: ဝင်ငွေ မှတ်တမ်းထည့်ရန်

# addExpenseTooltip
source: Add Expense Record
my: အသုံးစရိတ် မှတ်တမ်းထည့်ရန်

# financialSummaryTitle
source: Financial Summary
my: ဘဏ္ဍာရေး အနှစ်ချုပ်

# totalIncomeLabel
source: Total Income
my: စုစုပေါင်း ဝင်ငွေ

# totalExpensesLabel
source: Total Expenses
my: စုစုပေါင်း အသုံးစရိတ်

# netBalanceLabel
source: Net Balance
my: လက်ကျန်ငွေ

source: No income records found.
my: ဝင်ငွေ မှတ်တမ်းများ မတွေ့ပါ။

source: No expense records found.
my: အသုံးစရိတ် မှတ်တမ်းများ မတွေ့ပါ။

# confirmDeleteIncomeText
source: Are you sure you want to delete this income record?
my: ဤဝင်ငွေ မှတ်တမ်းကို ဖျက်ရန် သေချာပါသလား။

# confirmDeleteExpenseText
source: Are you sure you want to delete this expense record?
my: ဤအသုံးစရိတ် မှတ်တမ်းကို ဖျက်ရန် သေချာပါသလား။

# errorDeletingIncome
source: Error deleting income record.
my: ဝင်ငွေ မှတ်တမ်း ဖျက်ရာတွင် အမှားအယွင်းဖြစ်ပွားခဲ့သည်။

# errorDeletingExpense
source: Error deleting expense record.
my: အသုံးစရိတ် မှတ်တမ်း ဖျက်ရာတွင် အမှားအယွင်းဖြစ်ပွားခဲ့သည်။

# addEditFinancialRecordNotImplemented
source: Add/Edit financial record screen not yet implemented.
my: ဘဏ္ဍာရေး မှတ်တမ်း ထည့်/ပြင်ရန် မျက်နှာပြင်ကို မပြုလုပ်ရသေးပါ။

# editIncomeTitle
source: Edit Income
my: ဝင်ငွေ ပြင်ရန်

# addIncomeTitle
source: Add Income
my: ဝင်ငွေ ထည့်ရန်

# editExpenseTitle
source: Edit Expense
my: အသုံးစရိတ် ပြင်ရန်

# addExpenseTitle
source: Add Expense
my: အသုံးစရိတ် ထည့်ရန်

# descriptionLabel
source: Description
my: အကြောင်းအရာ

# descriptionValidator
source: Please enter a description.
my: ကျေးဇူးပြု၍ အကြောင်းအရာ ထည့်ပါ။

# amountLabel
source: Amount
my: ပမာဏ

# amountValidator
source: Please enter an amount.
my: ကျေးဇူးပြု၍ ပမာဏ ထည့်ပါ။

# invalidAmountError
source: Please enter a valid positive amount.
my: ကျေးဇူးပြု၍ မှန်ကန်သော ပမာဏ (အပေါင်းကိန်း) ထည့်ပါ။

# recordDateLabel
source: Date
my: ရက်စွဲ

# dateValidator
source: Please select a date.
my: ကျေးဇူးပြု၍ ရက်စွဲ ရွေးပါ။

# updateButton
source: Update
my: ပြင်ဆင်ရန်

# addButton
source: Add
my: ထည့်ရန်

# failedToSaveRecordError
source: Failed to save record.
my: မှတ်တမ်း သိမ်းဆည်းခြင်း မအောင်မြင်ပါ။

# announcementsTitle
source: Announcements
my: ကြေညာချက်များ

source: No announcements found.
my: ကြေညာချက်များ မတွေ့ပါ။

source: Posted on
my: တင်သည့်ရက်

# childAttendanceTitle
source: Child's Attendance
my: ကလေး၏ တက်ရောက်မှု

# noChildrenLinked
source: No children linked to your account.
my: သင်၏အကောင့်နှင့် ချိတ်ဆက်ထားသော ကလေး မရှိပါ။

# selectChildHint
source: Select Child
my: ကလေး ရွေးပါ

# pleaseSelectChild
source: Please select a child to view attendance.
my: တက်ရောက်မှု ကြည့်ရန် ကျေးဇူးပြု၍ ကလေးတစ်ဦး ရွေးပါ။

# noAttendanceRecordsFound
source: No attendance records found for the selected child and month.
my: ရွေးချယ်ထားသော ကလေးနှင့် လအတွက် တက်ရောက်မှု မှတ်တမ်းများ မတွေ့ပါ။

# childScheduleTitle
source: Child's Schedule
my: ကလေး၏ အချိန်ဇယား

# childNotAssignedToClass
source: Child is not currently assigned to a class or no schedule is available.
my: ကလေးသည် လက်ရှိတွင် အတန်းတစ်ခုခု၌ သတ်မှတ်ထားခြင်း မရှိပါ သို့မဟုတ် အချိန်ဇယား မရှိပါ။

# noScheduleFound
source: No schedule found for the selected child's class.
my: ရွေးချယ်ထားသော ကလေး၏ အတန်းအတွက် အချိန်ဇယား မတွေ့ပါ။

# manageAnnouncementsTitle
source: Manage Announcements
my: ကြေညာချက်များ စီမံရန်

# addAnnouncementTooltip
source: Add New Announcement
my: ကြေညာချက်အသစ် ထည့်ရန်

# confirmDeleteAnnouncementText
source: Are you sure you want to delete this announcement?
my: ဤကြေညာချက်ကို ဖျက်ရန် သေချာပါသလား။

source: Error deleting announcement.
my: ကြေညာချက် ဖျက်ရာတွင် အမှားအယွင်းဖြစ်ပွားခဲ့သည်။

source: Action requires school and admin context.
my: လုပ်ဆောင်ချက်အတွက် ကျောင်းနှင့် အက်မင် အချက်အလက် လိုအပ်သည်။

# addEditAnnouncementNotImplemented
source: Add/Edit Announcement screen not yet implemented.
my: ကြေညာချက် ထည့်/ပြင်ရန် မျက်နှာပြင်ကို မပြုလုပ်ရသေးပါ။

source: Target Audience
my: ပစ်မှတ် အုပ်စု

source: All
my: အားလုံး

source: Specific Class
my: သီးသန့်အတန်း

# closeButtonLabel
source: Close
my: ပိတ်မည်

# pleaseSelectClassForAnnouncement
source: Please select a class for this announcement.
my: ဤကြေညာချက်အတွက် အတန်းတစ်ခု ရွေးပါ။

# failedToSaveAnnouncementError
source: Failed to save announcement.
my: ကြေညာချက် သိမ်းဆည်းခြင်း မအောင်မြင်ပါ။

# editAnnouncementTitle
source: Edit Announcement
my: ကြေညာချက် ပြင်ရန်

# addAnnouncementTitle
source: Add Announcement
my: ကြေညာချက် ထည့်ရန်

# titleLabel
source: Title
my: ခေါင်းစဉ်

# titleValidator
source: Please enter a title.
my: ကျေးဇူးပြု၍ ခေါင်းစဉ် ထည့်ပါ။

# contentLabel
source: Content
my: အကြောင်းအရာ

# contentValidator
source: Please enter content.
my: ကျေးဇူးပြု၍ အကြောင်းအရာ ထည့်ပါ။

# selectTargetAudienceHint
source: Select Target Audience
my: ပစ်မှတ် အုပ်စု ရွေးပါ

# targetAudienceValidator
source: Please select a target audience.
my: ကျေးဇူးပြု၍ ပစ်မှတ် အုပ်စု ရွေးပါ။

# manageAnnouncementsDrawerItem
source: Manage Announcements
my: ကြေညာချက်များ စီမံရန်

# classOrUserMissingError
source: Class or user information is missing to save attendance.
my: တက်ရောက်မှု သိမ်းဆည်းရန် အတန်း သို့မဟုတ် အသုံးပြုသူ အချက်အလက် မပြည့်စုံပါ။

source: Failed to load initial data.
my: အချက်အလက်များ စတင်ရယူခြင်း မအောင်မြင်ပါ။

# failedToLoadSubjects
source: Failed to load subjects for the selected class.
my: ရွေးချယ်ထားသော အတန်းအတွက် ဘာသာရပ်များ ရယူခြင်း မအောင်မြင်ပါ။

# fillAllRequiredFields
source: Please fill all required fields.
my: လိုအပ်သော အကွက်အားလုံးကို ဖြည့်ပါ။

# failedToSaveLessonPlanError
source: Failed to save lesson plan.
my: သင်ခန်းစာ အစီအစဉ် သိမ်းဆည်းခြင်း မအောင်မြင်ပါ။

# editLessonPlanTitle
source: Edit Lesson Plan
my: သင်ခန်းစာ အစီအစဉ် ပြင်ရန်

# addLessonPlanTitle
source: Add Lesson Plan
my: သင်ခန်းစာ အစီအစဉ် ထည့်ရန်

# selectSubjectHint
source: Select Subject
my: ဘာသာရပ် ရွေးပါ

# subjectLabel
source: Subject
my: ဘာသာရပ်

# subjectValidator
source: Please select a subject.
my: ကျေးဇူးပြု၍ ဘာသာရပ် ရွေးပါ။

# pleaseSelectClassFirstForSubjects
source: Please select a class to see available subjects.
my: ဘာသာရပ်များ ကြည့်ရန် ကျေးဇူးပြု၍ အတန်းတစ်ခု ရွေးပါ။

# noSubjectsFoundForClass
source: No subjects found for the selected class. Please check timetable.
my: ရွေးချယ်ထားသော အတန်းအတွက် ဘာသာရပ်များ မတွေ့ပါ။ အချိန်ဇယား စစ်ဆေးပါ။

# manageDailyReportFormsTitle
source: Manage Daily Report Forms
my: နေ့စဉ် မှတ်တမ်းပုံစံများ စီမံရန်

# confirmDeleteCustomFormText
source: Are you sure you want to delete this form and all its responses? This action cannot be undone.
my: ဤပုံစံနှင့် သက်ဆိုင်သော တုံ့ပြန်မှုများအားလုံးကို ဖျက်ရန် သေချာပါသလား။ ဤလုပ်ဆောင်ချက်ကို နောက်ပြန်လှည့်၍မရပါ။

# errorDeletingCustomFormText
source: Error deleting custom form.
my: ပုံစံ ဖျက်ရာတွင် အမှားအယွင်းဖြစ်ပွားခဲ့သည်။

# noCustomFormsFoundText
source: No custom forms found. Tap '+' to create one.
my: စိတ်ကြိုက်ပုံစံများ မတွေ့ပါ။ တစ်ခုပြုလုပ်ရန် '+' ကိုနှိပ်ပါ။

# addCustomFormTooltip
source: Add New Report Form
my: မှတ်တမ်းပုံစံအသစ် ထည့်ရန်

source: Active From
my: စတင်အသုံးပြုနိုင်သည့်ရက်

source: Active To
my: နောက်ဆုံးအသုံးပြုနိုင်သည့်ရက်

source: Daily
my: နေ့စဉ်

source: Yes
my: ဟုတ်ကဲ့

source: No
my: မဟုတ်ပါ

# formDetailsTitle
source: Form Details
my: ပုံစံ အသေးစိတ်

# formTitleLabel
source: Form Title
my: ပုံစံ ခေါင်းစဉ်

# formTitleValidator
source: Form title is required.
my: ပုံစံ ခေါင်းစဉ် လိုအပ်ပါသည်။

# dailyReportLabel
source: Daily Recurring Report
my: နေ့စဉ် မှတ်တမ်းပုံစံ (အလိုအလျောက်)

# assignToLabel
source: Assign To:
my: သတ်မှတ်ရန်:

# assignToWholeSchoolLabel
source: Whole School
my: ကျောင်းတစ်ခုလုံး

# formQuestionsTitle
source: Form Questions
my: ပုံစံ မေးခွန်းများ

# addQuestionTooltip
source: Add Question
my: မေးခွန်းအသစ် ထည့်ရန်

# noQuestionsAddedText
source: No questions added yet. Click '+' to add.
my: မေးခွန်းများ မထည့်ရသေးပါ။ '+' ကိုနှိပ်၍ ထည့်ပါ။

# pleaseSelectActiveDatesError
source: Please select active dates.
my: ကျေးဇူးပြု၍ အသုံးပြုနိုင်မည့် ရက်အပိုင်းအခြားကို ရွေးပါ။

# activeToDateError
source: Active To date must be after Active From date.
my: နောက်ဆုံးရက်သည် စတင်ရက်ထက် နောက်ကျရပါမည်။

# addAtLeastOneQuestionError
source: Please add at least one question to the form.
my: ကျေးဇူးပြု၍ ပုံစံတွင် အနည်းဆုံး မေးခွန်းတစ်ခု ထည့်ပါ။

# failedToSaveFormError
source: Failed to save form.
my: ပုံစံ သိမ်းဆည်းခြင်း မအောင်မြင်ပါ။

# editReportFormTitle
source: Edit Report Form
my: မှတ်တမ်းပုံစံ ပြင်ရန်

# createReportFormTitle
source: Create Report Form
my: မှတ်တမ်းပုံစံသစ် ပြုလုပ်ရန်

# editQuestionTitle
source: Edit Question
my: မေးခွန်း ပြင်ရန်

# addQuestionTitle
source: Add Question
my: မေးခွန်း ထည့်ရန်

# questionTextLabel
source: Question Text
my: မေးခွန်း စာသား

# questionTextValidator
source: Question text is required.
my: မေးခွန်း စာသား လိုအပ်ပါသည်။

# questionTypeLabel
source: Question Type
my: မေးခွန်း အမျိုးအစား

# optionsLabel
source: Options (one per line)
my: ရွေးချယ်စရာများ (တစ်ကြောင်းလျှင် တစ်ခု)

# optionsRequiredError
source: Options are required for this question type.
my: ဤမေးခွန်းအမျိုးအစားအတွက် ရွေးချယ်စရာများ လိုအပ်ပါသည်။

# atLeastTwoOptionsError
source: At least two options are required for this question type.
my: ဤမေးခွန်းအမျိုးအစားအတွက် အနည်းဆုံး ရွေးချယ်စရာ နှစ်ခု လိုအပ်ပါသည်။

# requiredLabel
source: Required
my: မဖြစ်မနေ ဖြည့်ရန်

# typePrefixLabel
source: Type
my: အမျိုးအစား

# requiredSuffix
source: (Required)
my: (မဖြစ်မနေ)

# manageDailyReportsDrawerItem
source: Manage Daily Reports
my: နေ့စဉ် မှတ်တမ်းများ စီမံရန်

# assignToClassesLabel
source: Assign to Specific Classes:
my: သီးသန့်အတန်းများသို့ သတ်မှတ်ရန်:

# noClassesAvailableText
source: No classes available to assign.
my: သတ်မှတ်ရန် အတန်းများ မရှိပါ။

source: Error fetching forms
my: ပုံစံများ ရယူရာတွင် အမှားဖြစ်ပွားသည်

source: Error fetching form details
my: ပုံစံအသေးစိတ် ရယူရာတွင် အမှားဖြစ်ပွားသည်

source: Report submitted successfully!
my: မှတ်တမ်း အောင်မြင်စွာ တင်ပြီးပါပြီ!

source: Failed to submit report
my: မှတ်တမ်း တင်ခြင်း မအောင်မြင်ပါ

source: Error submitting report
my: မှတ်တမ်း တင်ရာတွင် အမှားဖြစ်ပွားသည်

# dailyReportsTitle
source: Daily Reports
my: နေ့စဉ် မှတ်တမ်းများ

# childLabel
source: Child
my: ကလေး

source: Select Report Form
my: မှတ်တမ်းပုံစံ ရွေးပါ

# selectFormHint
source: Select Form
my: ပုံစံ ရွေးပါ

source: Submitted
my: တင်ပြီး

# formLabel
source: Form
my: ပုံစံ

source: No active forms for today.
my: ယနေ့အတွက် အသုံးပြုနိုင်သော ပုံစံများ မရှိပါ။

# pleaseSelectForm
source: Please select a form.
my: ကျေးဇူးပြု၍ ပုံစံတစ်ခု ရွေးပါ။

# formHasNoQuestions
source: This form has no questions.
my: ဤပုံစံတွင် မေးခွန်းများ မရှိပါ။

# reportAlreadySubmitted
source: Report already submitted for this form today.
my: ဤပုံစံအတွက် ယနေ့ မှတ်တမ်းတင်ပြီးသား ဖြစ်သည်။

# submitReportButton
source: Submit Report
my: မှတ်တမ်း တင်မည်

# pleaseEnterValidNumber
source: Please enter a valid number.
my: ကျေးဇူးပြု၍ မှန်ကန်သော ကိန်းဂဏန်းတစ်ခု ထည့်ပါ။

# fieldRequiredValidation
source: This field is required.
my: ဤအကွက်ကို ဖြည့်ရန် လိုအပ်သည်။

# noParentsAvailableToLink
source: No parents available in this school to link.
my: ဤကျောင်းတွင် ချိတ်ဆက်ရန် မိဘများ မရှိပါ။

# linkParentsTitle
source: Link Parents:
my: မိဘများ ချိတ်ဆက်ရန်:

source: Unnamed Parent
my: အမည်မဖော်ပြထားသော မိဘ

# viewFormResponsesTitle
source: View Form Responses
my: ပုံစံ တုံ့ပြန်မှုများ ကြည့်ရန်

source: No forms available to view responses.
my: တုံ့ပြန်မှုများ ကြည့်ရန် ပုံစံများ မရှိပါ။

# selectFormToViewResponses
source: Select a form to view its responses
my: တုံ့ပြန်မှုများ ကြည့်ရန် ပုံစံတစ်ခု ရွေးပါ

# noResponsesForThisForm
source: No responses submitted for this form yet.
my: ဤပုံစံအတွက် တင်ထားသော တုံ့ပြန်မှုများ မရှိသေးပါ။

source: Response from
my: ထံမှ တုံ့ပြန်ချက်

source: Submitted on
my: တင်သည့်ရက်

source: Quick Actions
my: အမြန်လုပ်ဆောင်ချက်များ

source: Recent Activity
my: မကြာသေးမီက လုပ်ဆောင်ချက်များ

source: Total Students
my: စုစုပေါင်း ကျောင်းသား

source: Total Teachers
my: စုစုပေါင်း ဆရာများ

source: Total Parents
my: စုစုပေါင်း မိဘများ

source: Forms Today
my: ယနေ့အတွက် ပုံစံများ

# createNewFormAction
source: New Form
my: ပုံစံသစ်

# manageFormsAction
source: Manage Forms
my: ပုံစံများ စီမံရန်

# manageTeachersAction
source: Teachers
my: ဆရာများ

# manageParentsAction
source: Parents
my: မိဘများ

# viewReportsAction
source: View Reports
my: မှတ်တမ်းများ ကြည့်ရန်

# announcementsAction
source: Announcements
my: ကြေညာချက်များ

source: No recent activity.
my: မကြာသေးမီက လုပ်ဆောင်ချက် မရှိပါ။

# error_school_or_user_not_found
source: School or user information not found.
my: ကျောင်း သို့မဟုတ် အသုံးပြုသူ အချက်အလက် ရှာမတွေ့ပါ။

# selectGenderHint
source: Select Gender
my: ကျား/မ ရွေးပါ

# genderMale
source: Male
my: ကျား

# genderFemale
source: Female
my: မ

# genderOther
source: Other
my: အခြား

# genderLabel
source: Gender
my: ကျား/မ

# genderValidator
source: Please select a gender.
my: ကျေးဇူးပြု၍ ကျား/မ ရွေးပါ။

source: Unassigned
my: သတ်မှတ်မထားသော

source: No data available
my: အချက်အလက် မရှိပါ

# studentsDistributionByClassTitle
source: Students by Class
my: အတန်းအလိုက် ကျောင်းသားဦးရေ

# publishButton
source: Publish
my: ထုတ်ဝေမည်

# allAudience
source: All
my: အားလုံး

# teachersAudience
source: Teachers
my: ဆရာများ

# parentsAudience
source: Parents
my: မိဘများ

# selectTeacherHint
source: Select Teacher
my: ဆရာ/မ ရွေးပါ

# noTeachersAvailableHint
source: No teachers available
my: ရွေးချယ်ရန် ဆရာ/မ မရှိပါ

# formDescriptionLabel
source: Form Description
my: ပုံစံ အကြောင်းအရာ

# formTargetAudienceLabel
source: Target Audience
my: ပစ်မှတ် အုပ်စု

# formActiveLabel
source: Active
my: အသုံးပြုနိုင်သည်

# addQuestionButton
source: Add Question
my: မေးခွန်းထည့်ရန်

# fieldType_text
source: Text Input
my: စာသား ထည့်သွင်းရန်

# fieldType_yesNo
source: Yes/No
my: ဟုတ်/မဟုတ်

# fieldType_multipleChoice
source: Multiple Choice (Single Answer)
my: ရွေးချယ်စရာများ (အဖြေတစ်ခု)

# fieldType_checkbox
source: Checkbox (Multiple Answers)
my: ရွေးချယ်စရာများ (အဖြေများစွာ)

# fieldType_number
source: Number Input
my: ဂဏန်း ထည့်သွင်းရန်

# optionsForMCQCheckboxLabel
source: Options (for Multiple Choice/Checkbox, one per line)
my: ရွေးချယ်စရာများ (MCQ/Checkbox အတွက်၊ တစ်ကြောင်းလျှင် တစ်ခု)

# addOptionButton
source: Add Option
my: ရွေးချယ်စရာ ထည့်ရန်

# optionHint
source: Option
my: ရွေးချယ်စရာ

# saveFormButton
source: Save Form
my: ပုံစံ သိမ်းဆည်းရန်

# updateFormButton
source: Update Form
my: ပုံစံ ပြင်ဆင်ရန်

# optionTextValidator
source: Option text cannot be empty
my: ရွေးချယ်စရာ စာသား လိုအပ်သည်

# categoryLabel
source: Category
my: အမျိုးအစား
